#Програма зчитує число, вирішує в які рамки воно підпадає та повідомляє про це користувача.
# Рамки:
# Число дорівнює або менше ніж -500
# Дорівнює або менше ніж -100, але більше -500
# Менше ніж 0, але більше -100
# Дорівнює або більше ніж 0, але менше 100
# Дорівнює або більше ніж 100, але менше 500
# Дорівнює або більше ніж 500

n = int(input('Input the number:'))

if n <= -500:
    print('Число дорівнює або менше ніж -500')
elif n<=-100 and n>-500:
    print('Число дорівнює або менше -100, але більше -500')
elif n<0 and n>-100:
    print('Число менше ніж 0, але більше -100')
elif n>0 and n<100:
    print('Число більше ніж 0, але менше 100')
elif n>=100 and n<500:
    print('Число дорівнює або більше ніж 100, але менше 500')
elif n>=500:
    print('Число дорівнює, або більше ніж 500')
else:
    print('Введене число 0 не підпадає під жодну категорію')


