#Користувач вводить сторони опуклого чотирикутника.
#Якщо це прямокутник, програма знаходить його площу (це виконують дві окремі функції)
#Якщо це квадрат, програма повідомляє про це користувача (це перевіряє окрема функція)
#На зчитування введеного користувачем значення сторони теж рекомендую зробити функцію

#Підказка: серед опуклих чотирикутників, лише у прямокутників та квадратів діагоналі
# дорівнюють та утворюють прямокутний трикутник. Це можна перевірити, використовуючи теорему Піфагора.
# Дуже сильна підказка: опуклий чотирикутник є прямокутником, якщо сума квадратів його перших двох сторін
# дорівнює сумі квадратів його останніх двох сторін.



a = int(input('Введіть першу сторону чотирикутника: '))
b = int(input('Введіть другу сторону чотирикутника: '))
c = int(input('Введіть третю сторону чотирикутника: '))
d = int(input('Введіть четверту сторону чотирикутника: '))

s1 = (a * b) / 2

from math import sqrt
g = sqrt(a**2 + b**2)

p = (c + d + g) / 2

s2 = sqrt(p * (p - g) * (p - c) * (p - d))

s = s1 + s2
if a == b == c == d:
    print('Дана фігура є квадратом та її площа дорівнює =', s, 'см.кв')
else:
 print('Площа чотирикутника = ', s, 'см.квадратних')


